<?php
/**
* +----------------------------------------------------------------------
* 创建日期：2017年11月21日
* +----------------------------------------------------------------------
* https：//github.com/ALNY-AC
* +----------------------------------------------------------------------
* 微信：AJS0314
* +----------------------------------------------------------------------
* QQ:1173197065
* +----------------------------------------------------------------------
* #####测试#####
* @author 代码狮
*
*/

namespace Home\Controller;
use Think\Controller;
class TestController extends CommonController {
    
    public function index(){
        $subject_id='c72008da97b923fd0fa17bebd07f4d6a';
        $count=countSubject($subject_id);
        echo $count;
        die;
    }
}