<?PHP
session_start();
// $_POST['user_pid']
$user_pid=$_GET['user_pid'];
// echo $user_pid;
// die;
/*
| Submail message/xsend API demo
| SUBMAIL SDK Version 2.6 --PHP
| copyright 2011 - 2017 SUBMAIL
|--------------------------------------------------------------------------
*/

/*
|载入 app_config 文件
|--------------------------------------------------------------------------
*/
require '../app_config.php';

/*
|载入 SUBMAILAutoload 文件
|--------------------------------------------------------------------------
*/

require_once('../SUBMAILAutoload.php');

/*
|初始化 MESSAGEXsend 类
|--------------------------------------------------------------------------
*/

$submail=new MESSAGEXsend($message_configs);

/*
|必选参数
|--------------------------------------------------------------------------
|设置短信接收的11位手机号码
|--------------------------------------------------------------------------
*/


$submail->setTo($user_pid);

/*
|必选参数
|--------------------------------------------------------------------------
|设置短信模板ID
|--------------------------------------------------------------------------
*/

$submail->SetProject('QHc0L2');

/*
|可选参数
|--------------------------------------------------------------------------
|添加文本变量
|可多次调用
|--------------------------------------------------------------------------
*/


$_SESSION['user_code'] = rand(1000,9999);//注册session

// echo $_SESSION['code'];
$submail->AddVar('code',$_SESSION['user_code']);

/*
|调用 xsend 方法发送短信
|--------------------------------------------------------------------------
*/

$xsend=$submail->xsend();


/*
|打印服务器返回值
|--------------------------------------------------------------------------
*/
$xsend['user_code']=$_SESSION['user_code'] ;
echo json_encode($xsend);